serving/results/llama_qwen_ds_variants/logs/benchmarks/sandhi__models_qwen2_5_coder_7b_instruct.log

==================================
Running benchmarks (sandhi / qwen)
==================================

==================================
Target: qwen
Port: 12306
Model: /variants_sc/Qwen2.5-Coder-7B-Instruct
==================================
RPS=7
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 23:23:10][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 23:23:11 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 23:23:15][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 23:23:15][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 23:23:18.007000 32754 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 23:23:18.007000 32754 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 23:23:18][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 23:23:18][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 23:23:18][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 23:23:18][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7278ddf40680>, seed=0, num_prompts=250, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/variants_sc/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=7.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 23:23:19 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 624:28:41 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 7.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 250/250 [00:40<00:00,  6.25it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     250       
Request rate configured (RPS):           7.00      
Benchmark duration (s):                  40.02     
Total input tokens:                      24979     
Total generated tokens:                  225000    
Request throughput (req/s):              6.25      
Output token throughput (tok/s):         5622.66   
Peak output token throughput (tok/s):    7602.00   
Peak concurrent requests:                51.00     
Total Token throughput (tok/s):          6246.87   
---------------Time to First Token----------------
Mean TTFT (ms):                          25.31     
Median TTFT (ms):                        25.44     
P95 TTFT (ms):                           32.25     
P99 TTFT (ms):                           34.86     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          5.19      
Median TPOT (ms):                        5.22      
P95 TPOT (ms):                           5.62      
P99 TPOT (ms):                           5.65      
---------------Inter-token Latency----------------
Mean ITL (ms):                           5.19      
Median ITL (ms):                         5.17      
P95 ITL (ms):                            6.25      
P99 ITL (ms):                            7.11      
==================================================
RPS=10
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 23:24:06][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 23:24:07 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 23:24:11][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 23:24:11][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 23:24:14.241000 33275 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 23:24:14.241000 33275 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 23:24:14][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 23:24:14][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 23:24:14][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 23:24:14][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f3f1cda45e0>, seed=0, num_prompts=250, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/variants_sc/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=10.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 23:24:15 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 574:57:25 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 250/250 [00:29<00:00,  8.39it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     250       
Request rate configured (RPS):           10.00     
Benchmark duration (s):                  29.79     
Total input tokens:                      24979     
Total generated tokens:                  225000    
Request throughput (req/s):              8.39      
Output token throughput (tok/s):         7552.96   
Peak output token throughput (tok/s):    9651.00   
Peak concurrent requests:                73.00     
Total Token throughput (tok/s):          8391.47   
---------------Time to First Token----------------
Mean TTFT (ms):                          28.05     
Median TTFT (ms):                        27.74     
P95 TTFT (ms):                           35.83     
P99 TTFT (ms):                           37.67     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          6.06      
Median TPOT (ms):                        6.19      
P95 TPOT (ms):                           6.54      
P99 TPOT (ms):                           6.54      
---------------Inter-token Latency----------------
Mean ITL (ms):                           6.06      
Median ITL (ms):                         6.10      
P95 ITL (ms):                            7.51      
P99 ITL (ms):                            8.56      
==================================================
RPS=15
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 23:24:52][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 23:24:53 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 23:24:57][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 23:24:57][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 23:25:00.112000 33667 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 23:25:00.112000 33667 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 23:25:00][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 23:25:00][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 23:25:00][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 23:25:00][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7823187547c0>, seed=0, num_prompts=250, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/variants_sc/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=15.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 23:25:01 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 594:06:13 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 15.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 250/250 [00:22<00:00, 11.04it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     250       
Request rate configured (RPS):           15.00     
Benchmark duration (s):                  22.65     
Total input tokens:                      24979     
Total generated tokens:                  225000    
Request throughput (req/s):              11.04     
Output token throughput (tok/s):         9934.00   
Peak output token throughput (tok/s):    12565.00  
Peak concurrent requests:                126.00    
Total Token throughput (tok/s):          11036.85  
---------------Time to First Token----------------
Mean TTFT (ms):                          31.22     
Median TTFT (ms):                        31.45     
P95 TTFT (ms):                           44.16     
P99 TTFT (ms):                           48.08     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          7.60      
Median TPOT (ms):                        7.93      
P95 TPOT (ms):                           8.37      
P99 TPOT (ms):                           8.37      
---------------Inter-token Latency----------------
Mean ITL (ms):                           7.60      
Median ITL (ms):                         7.79      
P95 ITL (ms):                            9.71      
P99 ITL (ms):                            11.02     
==================================================